RIET/src/Catalogs/ПрочиеДоходыИРасходы/ПрочиеДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрочиеДоходыИРасходы</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДоходыРасходыПриПродажеПокупкеВалюты</name>
      <description>Доходы (расходы), связанные с продажей (покупкой) валюты</description>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы</description>
    </items>
    <items>
      <name>ОтклонениеКурсаПродажиПокупкиВалюты</name>
      <description>Отклонения курса продажи (покупки) иностранной валюты от официального курса</description>
    </items>
    <items>
      <name>РазницыЗалоговойИФактическойСтоимостиТары</name>
      <description>Разницы залоговой и фактической стоимости тары</description>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
    </items>
    <items>
      <name>СуммовыеРазницы</name>
      <description>Суммовые разницы</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидПрочихДоходовИРасходов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыПрочихДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
    <type>
      <types>EnumRef.ОтнесениеРасходовКДеятельностиЕНВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятиеКналоговомуУчету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/ОтнесениеРасходовКДеятельностиЕНВД/ОтнесениеРасходовКДеятельностиЕНВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
  <enumValues>
    <name>РасходыОтносятсяКнеЕНВД</name>
  </enumValues>
  <enumValues>
    <name>РасходыОтносятсяКЕНВД</name>
  </enumValues>
  <enumValues>
    <name>РасходыРаспределяются</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/ПрочиеДоходыИРасходы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		Если ОтнесениеРасходовКДеятельностиЕНВД.Пустая() Тогда
			Сообщить("Укажите вид отнесения расходов к деятельности, облагаемой ЕНВД!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ОтнесениеРасходовКДеятельностиЕНВД = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД Тогда
			ПринятиеКналоговомуУчету = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	Если Не ЭтоГруппа Тогда
		ПринятиеКналоговомуУчету = Истина;
		ОтнесениеРасходовКДеятельностиЕНВД = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКнеЕНВД;
	КонецЕсли;

КонецПроцедуры
